/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   check_syntax.c                                     :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: joushin <joushin@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/11/12 12:33:29 by joushin           #+#    #+#             */
/*   Updated: 2022/11/13 19:54:02 by joushin          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "./include/node.h"


// 1. pipe_tok는 앞 뒤에 argv_tok가 있는지 확인
// 2. io_tok 같은 경우 뒤에 argv_tok가 있는지 확인


void	check_syntax(t_token *start_tok)
{

}
